In [1]:
import numpy as np
import pandas as pd

In [21]:
df01 = pd.DataFrame({
    'A': [1, 1, 2, 2, 3, 3, 4, 4, 5, 5],
    'B': [1, 2, 1, 2, 1, 2, 1, 2, 1, 2],
    'C': np.random.randn(10)
})

In [39]:
df01

   A  B         C
0  1  1 -1.491360
1  1  2 -1.122763
2  2  1  1.083356
3  2  2  2.167982
4  3  1  1.321720
5  3  2 -1.148722
6  4  1  1.191660
7  4  2 -1.736260
8  5  1  0.794396
9  5  2 -1.240322

In [29]:
df01_agg01 = df01.groupby('A').agg(['count', 'min', 'max', 'mean', 'median'])
df01_agg01

      B                         C
  count min max mean median count       min       max      mean    median
A
1     2   1   2  1.5    1.5     2 -1.491360 -1.122763 -1.307061 -1.307061
2     2   1   2  1.5    1.5     2  1.083356  2.167982  1.625669  1.625669
3     2   1   2  1.5    1.5     2 -1.148722  1.321720  0.086499  0.086499
4     2   1   2  1.5    1.5     2 -1.736260  1.191660 -0.272300 -0.272300
5     2   1   2  1.5    1.5     2 -1.240322  0.794396 -0.222963 -0.222963

In [33]:
df01_agg01['C'][['count', 'median']]

   count    median
A
1      2 -1.307061
2      2  1.625669
3      2  0.086499
4      2 -0.272300
5      2 -0.222963

In [30]:
df01_agg02 = df01[['A', 'C']].groupby('A').agg(['count', 'min', 'max', 'mean', 'median'])
df01_agg02

      C
  count       min       max      mean    median
A
1     2 -1.491360 -1.122763 -1.307061 -1.307061
2     2  1.083356  2.167982  1.625669  1.625669
3     2 -1.148722  1.321720  0.086499  0.086499
4     2 -1.736260  1.191660 -0.272300 -0.272300
5     2 -1.240322  0.794396 -0.222963 -0.222963

# Applying a function to every row

## Example 1: Using a custom function

In [37]:
def add_abc(a, b, c):
    return a + b + c

df01_add_abc = df01.apply(lambda row: add_abc(row['A'],
                                             row['B'],
                                             row['C']),
                         axis = 1)
df01_add_abc

0    0.508640
1    1.877237
2    4.083356
3    6.167982
4    5.321720
5    3.851278
6    6.191660
7    4.263740
8    6.794396
9    5.759678
dtype: float64

## Example 2: Using numpy functions

In [38]:
df01_sum = df01.apply(np.sum, axis = 1)
df01_sum

0    0.508640
1    1.877237
2    4.083356
3    6.167982
4    5.321720
5    3.851278
6    6.191660
7    4.263740
8    6.794396
9    5.759678
dtype: float64

In [41]:
-1.491360 + 2

0.50864

In [44]:
df01.apply(np.sum, axis = 0)

A    30.000000
B    15.000000
C    -0.180313
dtype: float64